app/controllers/tweets_controller.rb

  def index
    @tweets = Tweet.all.order("created_at DESC")
---
SELECT "tweets".* FROM "tweets" ORDER BY created_at DESC

  def create
    @tweet = Tweet.new(tweet_params)

    respond_to do |format|
      if @tweet.save
---
INSERT INTO "tweets" ("tweet", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["tweet", "4th tweet"], ["created_at", "2020-10-09 20:09:12.569673"], ["updated_at", "2020-10-09 20:09:12.569673"], ["user_id", 2]]

  def update
    respond_to do |format|
      if @tweet.update(tweet_params)
---
UPDATE "tweets" SET "tweet" = ?, "updated_at" = ? WHERE "tweets"."id" = ?  [["tweet", "Hello I just discovered that I'm a hacker"], ["updated_at", "2020-10-08 21:16:40.924695"], ["id", 4]]